#+property: header-args    :tangle yes 
#+property: header-args    :tangle .profile

** other
   :PROPERTIES:
   :created:  2020-02-02 00:44:04 CST
   :END:
Vim or emacs? Both. I'm aliasing =emacsclient(1)= because =emacs(1)= is
typically invoked just once at startup. 
#+BEGIN_SRC sh
  alias e="emacsclient"
  alias v="vim"
#+END_SRC

More aliases
#+BEGIN_SRC sh
  alias python="python3"
  alias ju="jupyter notebook &> /dev/null & disown"
#+END_SRC

Setup for colored =ls(1)= output. First, we alias the obvious. 
#+BEGIN_SRC sh
  alias ls="ls --color"
#+END_SRC

This sets the =LS_COLORS= environment variable according to my
customizations.
#+BEGIN_SRC sh
  if [[ -f ~/.dircolors ]]; then
      eval "$(env TERM=xterm dircolors ~/.dircolors)"
  fi
#+END_SRC

These are also "environment" objects, so they need to be manually
colored. See my =~/.dircolors=. The colors or definitions may change, so
this block is liable to changing. 
#+BEGIN_SRC sh
  ENV_C="35;46;01"
  LS_COLORS="${LS_COLORS}*profile=$ENV_C:"
  LS_COLORS="${LS_COLORS}*dircolors=$ENV_C:"
  LS_COLORS="${LS_COLORS}*gitconfig=$ENV_C:"
  LS_COLORS="${LS_COLORS}*emacs=$ENV_C:"
  LS_COLORS="${LS_COLORS}*emacs_bash=$ENV_C:"
  LS_COLORS="${LS_COLORS}*vimrc=$ENV_C:"
#+END_SRC

Let =**= match zero or more directories and subdirectories. I'm not
tangling, because I have almost never used this feature. 
#+BEGIN_SRC sh
  shopt -s globstar # Thu Feb  7 20:53:09 EST 2019
#+END_SRC

This function determines whether we're on a desktop machine. As is,
we're literally just testing if we're using a x86 machine. 
#+BEGIN_SRC sh 
    function jmw_on_desktop () {
	[[ $(uname -m) = x86* ]]
    }
#+END_SRC

When run on my lenovo,
#+BEGIN_SRC sh :results output :tangle no
    function jmw_on_desktop () {
	[[ $(uname -m) = x86* ]]
    }
    jmw_on_desktop
    echo "$?"
#+END_SRC

#+RESULTS:
: 0

Similarly, to detect whether we're on mobile. It isn't very advanced.
#+BEGIN_SRC sh 
  function jmw_on_mobile () {
      ! jmw_on_desktop
  }
#+END_SRC

When run on my lenovo,
#+BEGIN_SRC sh :results output :tangle no
  function jmw_on_desktop () {
      [[ $(uname -m) = x86* ]]
  }
  function jmw_on_mobile () {
      ! jmw_on_desktop
  }
  jmw_on_mobile
  echo "$?"
#+END_SRC

#+RESULTS:
: 1

For some reason, I had this in my old config file. It's from my SLS
UROP.
#+BEGIN_SRC sh
  export HDF5_USE_FILE_LOCKING=FALSE # See https://github.com/MPAS-Dev/MPAS-Analysis/issues/407
#+END_SRC

Main block for desktop-specific config stuff.
#+BEGIN_SRC sh :noweb yes
  if jmw_on_desktop; then
      <<desktop>>
  fi
#+END_SRC

Main block for mobile-specific config stuff. 
#+BEGIN_SRC sh :noweb yes
  if jmw_on_mobile; then
      <<mobile>>
  fi
#+END_SRC
